[
  {
    "id": "angular",
    "name": "Angular",
    "category": "compétences techniques",
    "title": "Angular",
    "image": "assets/angular.jpeg",
    "description": "<h2>Introduction</h2>\n<p class=\"justified\">Angular est un framework JavaScript open source développé par Google depuis 2016. Il fournit toutes les fonctionnalités nécessaires à la construction d’une application web : gestion du routage, communication HTTP, formulaires, architecture modulaire, injection de dépendances, etc.</p>\n\n<p class=\"justified\">Angular repose sur TypeScript, un sur-ensemble typé de JavaScript, ce qui le rend particulièrement adapté à la construction d’applications complexes et robustes. Le framework adopte une architecture basée sur les composants, avec un cycle de vie bien défini et une séparation claire entre logique métier et présentation.</p>\n\n<p class=\"justified\">Il est couramment utilisé dans des stacks full stack comme MEAN (MongoDB, Express, Angular, Node.js), où Angular gère la partie frontend. Grâce à son CLI, il facilite la génération de composants, services et l’organisation du code selon les bonnes pratiques.</p>\n\n<h2>Mon expérience vécue</h2>\n<p class=\"justified\">Durant ma dernière année d'études, j'ai utilisé Angular dans deux projets majeurs :</p>\n\n<h3>Mon portfolio</h3>\n<p class=\"justified\">Ce site même est une application Angular standalone. Il intègre les dernières fonctionnalités du framework comme les composants standalone, Angular Material pour l’UI, et un pipeline CI/CD avec GitHub Actions. Ce projet m’a permis de consolider mes compétences sur la structure modulaire d’un projet Angular, l’utilisation de services, et le routage dynamique.</p>\n\n<h3>PMT (Project Management Tool)</h3>\n<p class=\"justified\">PMT est une plateforme de gestion de projet collaborative destinée aux équipes de développement logiciel. J’ai conçu toute l’interface utilisateur avec Angular, en intégrant des composants modulaires dynamiques (dashboard, gestion des tâches, formulaires, etc.). Ce projet m’a confronté à des cas réels complexes : formulaires réactifs, API REST, gestion d’état, responsive design, et guidelines techniques strictes.</p>\n\n<h2>Mon niveau de compétence</h2>\n<p class=\"justified\">Aujourd’hui, je suis autonome dans le développement Angular. Je maîtrise :</p>\n\n<ul class=\"justified\">\n  <li>la configuration d’un projet Angular (standalone ou avec modules)</li>\n  <li>la création de composants, services, pipes réutilisables</li>\n  <li>l'intégration d’Angular Material pour un design professionnel</li>\n  <li>le routage dynamique avec <code>ActivatedRoute</code></li>\n  <li>la gestion d’état avec RxJS</li>\n  <li>la connexion à des APIs avec <code>HttpClient</code></li>\n  <li>la structuration du code selon les conventions Angular</li>\n</ul>\n\n<p class=\"justified\">Je continue de progresser sur les tests end-to-end (Jasmine, Karma), l’optimisation (lazy loading, change detection), et l’usage avancé de NgRx.</p>\n\n<p class=\"justified\"><strong>Conclusion :</strong> Angular est exigeant, mais son cadre rigoureux et sa stabilité en font un excellent choix pour les projets sérieux et à long terme.</p>",
    "projetsAssocies": ["Portfolio", "Project Management Tool"]
  },

  {
    "id": "java-spring",
    "name": "Java (Spring Boot)",
    "category": "compétences techniques",
    "title": "Développement backend avec Java et Spring Boot",
    "image": "assets/java-spring.jpeg",
    "description": "<h2>Introduction</h2><p>Java est un langage de programmation orienté objet reconnu pour sa robustesse, sa portabilité et sa grande scalabilité. Dans le monde du développement d’applications web, <strong>Spring Boot</strong> s’impose aujourd’hui comme un framework incontournable pour créer des API REST performantes, modulaires et faciles à maintenir.</p><p>Spring Boot offre un gain de temps non négligeable grâce à ses <em>conventions intelligentes</em>, sa gestion automatique des beans, son serveur embarqué, et sa documentation bien fournie. Il s’intègre parfaitement avec des bases de données relationnelles (via JPA/Hibernate) et des outils modernes de développement (comme Postman ou IntelliJ IDEA).</p><h2>Mon expérience vécue</h2><p>J’ai utilisé <strong>Java avec Spring Boot</strong> dans le cadre du projet <strong>Project Management Tool</strong>, une application de gestion collaborative de projets. J’ai conçu plusieurs endpoints REST pour la gestion des utilisateurs, des projets et des tâches, et utilisé Spring Boot pour structurer l’ensemble du backend.</p><p>J’ai utilisé <strong>IntelliJ IDEA</strong> comme principal IDE, ce qui m’a permis d’accélérer mon workflow grâce à ses outils avancés. Cette mission m’a permis de développer une vraie rigueur technique sur la partie backend et de mieux comprendre l’importance d’une architecture REST bien conçue.</p><h2>Mon niveau de compétence</h2><p>Je suis à l’aise pour concevoir une API REST complète avec Java Spring Boot, documentée, connectée à une base SQL et intégrée à un frontend Angular. Je continue à me former sur des notions avancées comme la sécurité (Spring Security), les tests et les performances.</p><h2>Réalisations associées</h2><ul><li>Project Management Tool (backend Java Spring Boot)</li><li>Portfolio</li></ul>",
    "projetsAssocies": ["Project Management Tool", "Portfolio"]
  },

  {
    "id": "abap",
    "name": "ABAP (SAP)",
    "category": "compétences techniques",
    "title": "Développement technique dans l’environnement SAP avec ABAP",
    "image": "assets/abap.jpeg",
    "description": "<h2>Introduction</h2><p><strong>ABAP</strong> (Advanced Business Application Programming) est le langage de programmation propriétaire de SAP. Il permet de développer des programmes sur mesure pour enrichir les processus métiers, automatiser des traitements et corriger les flux de données dans un environnement SAP ERP. Utilisé pour gérer les échanges inter-systèmes (IDocs), la personnalisation des interfaces, et les rapports complexes, il reste une brique incontournable dans les projets d’intégration ou de maintenance SAP.</p><h2>Mon expérience vécue</h2><p>Pendant six mois, j’ai assuré la gestion quotidienne des erreurs d’IDocs dans un système SAP ECC. Mon rôle était à la fois opérationnel (correction d’erreurs) et fonctionnel (communication avec le client sur les causes, les pistes d’amélioration, et les optimisations possibles). En parallèle, j’étais en lien direct avec les développeurs ABAP pour transmettre les évolutions à apporter aux programmes. Cette mission m’a permis de mieux comprendre le rôle critique d’ABAP dans la fluidité des échanges de données, et d’acquérir de solides bases techniques pour dialoguer avec les équipes de développement.</p><h2>Mon niveau de compétence</h2><p>Je suis aujourd’hui capable d’analyser un programme ABAP, de comprendre sa logique, d’identifier des erreurs et de formuler des spécifications précises pour le faire évoluer. Je sais utiliser les outils clés de SAP (SE38, SE80, WE02, WE19, ST22) pour diagnostiquer et suivre un flux, et j’ai acquis une méthode rigoureuse pour assurer la traçabilité et la fiabilité des corrections apportées. Je poursuis ma montée en compétence vers l’ABAP orienté objets et la gestion optimisée des performances en vue des évolutions vers S/4HANA.</p>",
    "projetsAssocies": ["Cockpit", "ZFB47", "Gestion des IDocs"]
  },

  {
    "id": "sql",
    "name": "SQL",
    "category": "compétences techniques",
    "title": "Langage SQL et manipulation de données relationnelles",
    "image": "assets/sql.jpeg",
    "description": "<h2>Introduction</h2><p class=\"justified\">SQL (Structured Query Language) est un langage standardisé permettant de manipuler et d’interroger des bases de données relationnelles. Il est utilisé dans la majorité des systèmes de gestion de bases de données tels que MySQL, PostgreSQL, Oracle ou Microsoft SQL Server. Grâce à SQL, on peut interagir directement avec les données stockées pour les consulter, les modifier, ou encore structurer les relations entre elles via des jointures ou des vues.</p><p class=\"justified\">Que ce soit dans le développement d'applications, l’analyse de données ou la maintenance de systèmes ERP, SQL est une compétence fondamentale dans les métiers techniques. Il joue aussi un rôle clé dans la validation fonctionnelle, l'audit des données et l'automatisation de processus d'extraction.</p><h2>Mon expérience vécue</h2><p class=\"justified\">J’ai utilisé SQL dans plusieurs projets, notamment dans le cadre du <strong>Project Management Tool</strong> où j’ai travaillé sur la gestion et l’extraction de données via le backend développé avec Spring Boot. J’ai écrit et optimisé des requêtes pour afficher dynamiquement les tâches et les utilisateurs dans l’interface Angular.</p><p class=\"justified\">J’ai également utilisé SQL dans le contexte SAP, pour analyser des données issues de différentes tables transactionnelles. J’ai notamment mobilisé des connaissances sur la structure des bases SAP pour vérifier des incohérences, appuyer des analyses métier, ou transmettre des informations techniques aux développeurs.</p><p class=\"justified\">Dans un cadre plus académique ou personnel, j’ai conçu des bases de données relationnelles simples et mis en œuvre des requêtes complexes utilisant des jointures, des agrégations ou des filtres avancés.</p><h2>Mon niveau de compétence</h2><p class=\"justified\">Je maîtrise aujourd’hui les requêtes SQL fondamentales (<code>SELECT</code>, <code>JOIN</code>, <code>GROUP BY</code>, <code>INSERT</code>, <code>UPDATE</code>, etc.) et je suis capable d’analyser des structures de base de données pour y naviguer efficacement. J'utilise les alias, les sous-requêtes et les conditions combinées pour répondre à des besoins spécifiques.</p><p class=\"justified\">Je continue à progresser sur l'optimisation des performances des requêtes, l'analyse de plans d'exécution et la gestion des index. Je m’efforce de produire des requêtes lisibles, fiables et réutilisables, tout en comprenant leur impact sur la base.</p>",
    "projetsAssocies": ["project management tool"]
  },

  {
    "id": "ux-ui",
    "name": "UX/UI",
    "category": "compétences techniques",
    "title": "UX/UI – Conception d’interfaces utilisateur",
    "image": "assets/ux-ui.jpeg",
    "description": "<h2>Introduction</h2><p>L’UX (User Experience) et l’UI (User Interface) sont deux disciplines essentielles dans la création de solutions digitales. L’UX vise à garantir une expérience fluide, intuitive et agréable pour l’utilisateur, tandis que l’UI concerne la conception visuelle de l’interface, incluant les couleurs, les icônes, les typographies et les animations.</p><p>Une bonne maîtrise de l’UX/UI permet de concevoir des applications non seulement esthétiques, mais aussi fonctionnelles, accessibles et cohérentes avec les attentes des utilisateurs. Dans un contexte où les utilisateurs sont de plus en plus exigeants, la qualité de l’expérience devient un levier stratégique fort.</p>\n\n<h2>Mon expérience vécue</h2><p>J’ai pu développer mes compétences en UX/UI principalement lors de la réalisation de mon portfolio ainsi que dans le projet Project Management Tool. Sur ces projets, j’ai été amenée à réfléchir à l’ergonomie globale, au parcours utilisateur et à la disposition logique des éléments.</p><p>Concernant l’UI, j’ai utilisé Angular Material pour concevoir des interfaces modernes et épurées. J’ai fait attention aux contrastes, à la hiérarchisation des informations, à la cohérence des composants et à la responsivité de l’ensemble. L’objectif était de proposer une interface claire, professionnelle, et agréable à utiliser, aussi bien sur desktop que sur mobile.</p><p>Sur la partie UX, j’ai recueilli des retours d’utilisateurs potentiels (étudiants, encadrants, collègues), ce qui m’a permis d’identifier certaines zones de friction et de les corriger rapidement. J’ai également tenu compte des bonnes pratiques issues du design thinking, comme l’empathie, l’itération, et la simplification des actions répétitives.</p>\n\n<h2>Mon niveau de compétence</h2><p>Aujourd’hui, je sais structurer une interface cohérente en respectant les principes de design visuel (alignement, équilibre, contraste, espace blanc) et d’interaction (feedback, navigation fluide, affordance). Je suis capable de construire une interface responsive en partant d’une maquette ou d’un wireframe, et d’utiliser des composants préexistants tout en les personnalisant selon les besoins.</p><p>Je continue de m’améliorer en UX, notamment sur l’analyse des comportements utilisateurs, les tests d’accessibilité et l’amélioration continue de l’expérience sur des projets déjà en production. Je consulte régulièrement des ressources spécialisées (ex : UX Planet, Nielsen Norman Group) et je m’inspire des systèmes de design tels que Material Design ou Fluent UI.</p>",
    "projetsAssocies": ["Portfolio", "Project Management Tool","Cockpit", "ZFB47"]
  },

  {
    "id": "sap",
    "name": "SAP",
    "category": "compétences techniques",
    "title": "SAP – Analyse fonctionnelle et accompagnement des utilisateurs",
    "image": "assets/sap.jpeg",
    "description": "<h2>Introduction</h2><p>SAP est un ERP (Enterprise Resource Planning) largement utilisé dans les grandes entreprises pour centraliser et gérer l’ensemble des processus métiers. Côté fonctionnel, le rôle consiste à faire le lien entre les besoins des utilisateurs métiers et les solutions techniques disponibles dans le système SAP. Cela comprend la compréhension des flux, l’analyse des anomalies, la rédaction de spécifications fonctionnelles et la recette des évolutions.</p><p>Le consultant fonctionnel SAP joue également un rôle clé dans l’accompagnement des utilisateurs, la formation, la documentation, et l’amélioration continue des processus. Les domaines fonctionnels peuvent être variés : logistique, finance, achats, production, ventes, etc.</p>\n\n<h2>Mon expérience vécue</h2><p>J’ai développé ma compétence SAP fonctionnelle lors de plusieurs missions au sein d’une entreprise du secteur industriel. J’ai notamment été chargée de la <strong>gestion quotidienne des erreurs IDocs</strong>, en intervenant sur les messages bloqués liés à des flux inter-systèmes (approvisionnements, livraisons, etc.).</p><p>Mon rôle consistait à analyser les causes racines des erreurs, proposer des corrections à court terme, et surtout, <strong>collaborer avec les utilisateurs métiers et les développeurs ABAP</strong> pour éviter les récurrences. Ces échanges m’ont permis de comprendre en profondeur les processus logistiques SAP, d’identifier les impacts métiers, et de <strong>structurer des demandes d’évolution</strong> concrètes.</p><p>J’ai aussi contribué à la phase de recette sur des transactions spécifiques (comme la gestion des bons de commande), en rédigeant des plans de tests, en suivant les tickets utilisateurs, et en assurant un reporting régulier à l’équipe projet.</p>\n\n<h2>Mon niveau de compétence</h2><p>Je suis aujourd’hui à l’aise avec :</p><ul><li>la navigation dans les modules SAP (MM, SD, IDoc monitoring)</li><li>l’analyse d’erreurs dans WE02 / BD87</li><li>la rédaction de spécifications fonctionnelles claires et structurées</li><li>la communication avec les utilisateurs métiers et les équipes techniques</li><li>le suivi d’anomalies et la coordination de plans d’amélioration continue</li></ul><p>Je continue à me former sur les bonnes pratiques en gestion de projet SAP et à développer mon autonomie dans la résolution d’incidents et le paramétrage de base. SAP fonctionnel est une compétence transversale, entre technique, métier et communication, que je compte renforcer dans mes futures missions.</p>",
    "projetsAssocies": ["Cockpit", "Gestion des IDocs", "zfb47"]
  },


  {
    "id": "agile",
    "name": "Agile",
    "category": "compétences humaines",
    "title": "Agilité et gestion de projet itérative",
    "image": "assets/agile-scrum.jpeg",
    "description": "<h2>Introduction</h2><p>L'agilité est une approche moderne et adaptative de la gestion de projet, largement adoptée dans le développement logiciel et au-delà. Basée sur une planification itérative et incrémentale, elle permet de livrer rapidement de la valeur tout en s'adaptant aux changements constants des besoins métiers. L’agilité repose sur le Manifeste Agile, qui valorise les interactions humaines, la collaboration avec le client, les logiciels fonctionnels, et la réactivité au changement.</p><p>Parmi les méthodes les plus utilisées, on retrouve <strong>Scrum</strong>, <strong>Kanban</strong>, et <strong>Extreme Programming (XP)</strong>. Ces méthodologies ont pour but d'améliorer la transparence, la collaboration, et la qualité globale des livrables. Une étude menée en 2022 montre que <strong>87 %</strong> des équipes utilisent aujourd’hui Scrum, contre <strong>54 %</strong> seulement deux ans plus tôt.</p><h2>Mon expérience vécue</h2><p>J’ai eu l’occasion de pratiquer l’Agile à plusieurs reprises dans mes projets, notamment dans la réalisation de mon portfolio personnel et lors du développement de la plateforme collaborative <strong>Project Management Tool (PMT)</strong>. Sur ce projet, nous avons adopté une approche Scrum avec des sprints courts, une priorisation continue des user stories, et une implication directe du Product Owner.</p><p>Cette méthode nous a permis de livrer régulièrement des incréments fonctionnels, tout en améliorant la communication au sein de l’équipe et avec les parties prenantes. Même en contexte de contrainte ou d’ajustement de planning, le cadre Agile nous a offert une vraie flexibilité.</p><h2>Mon niveau de compétence</h2><p>Aujourd’hui, je maîtrise les fondements de <strong>Scrum</strong>, à la fois dans sa mise en œuvre théorique (rôles, artefacts, cérémonies) et dans son application concrète via des outils comme <em>Trello</em> ou <em>Jira</em>.</p><ul><li>Structurer un backlog produit clair et priorisé</li><li>Planifier et faciliter des sprints et des rétrospectives</li><li>Suivre l’évolution du projet avec des outils de gestion Agile</li><li>Favoriser la communication au sein de l’équipe projet</li></ul><p>Je continue à me former de manière autonome sur le sujet à travers des lectures comme <em>« Gestion de projet Agile »</em> (Eyrolles), afin de devenir progressivement référente sur ce type de démarche, aussi bien dans des projets en équipe que pour mes propres réalisations personnelles.</p><h2>Réalisations associées</h2><ul><li>PMT (Project Management Tool)</li><li>Portfolio (Angular, CI/CD, Material)</li><li>Cockpit (pilotage digitalisé de flux industriels)</li></ul>",
    "projetsAssocies": ["Portfolio", "Project Management Tool"]

  },

  {
    "id": "management transversal",
    "name": "Management Transversal",
    "category": "compétences humaines",
    "title": "Management transversal et coordination interservices",
    "image": "assets/transversal-management.jpeg",
    "description": "<h2>Introduction</h2><p>Le <strong>management transversal</strong> est une compétence clé dans les environnements professionnels modernes. Contrairement au management hiérarchique traditionnel, il repose sur la <strong>collaboration entre équipes issues de différents services</strong>, souvent sans lien de subordination directe. C’est une capacité à fédérer, à faire circuler l’information, à harmoniser les objectifs et à faire avancer un projet commun, malgré des priorités parfois divergentes.</p><p>Dans les projets informatiques complexes, notamment ceux liés aux ERP comme SAP, cette compétence devient cruciale. Elle permet de fluidifier la communication, d’éviter les frictions, et d’assurer une meilleure coordination entre les équipes techniques, fonctionnelles, métiers et parfois même externes.</p><h2>Mon expérience vécue</h2><p>J’ai eu l’occasion de développer cette compétence lors d’un projet d’évolution SAP, plus précisément pendant la <strong>phase de recette fonctionnelle (UAT)</strong> d’une transaction liée aux bons de commande.</p><p>Durant cette période, j’ai joué un <strong>rôle de facilitatrice</strong> entre plusieurs acteurs du projet :</p><ul><li>Les <em>utilisateurs métier</em></li><li>L’<em>équipe fonctionnelle SAP</em></li><li>Les <em>développeurs techniques</em></li></ul><p>Mon objectif était de centraliser les retours, assurer leur bonne compréhension technique, et coordonner les échanges entre les parties prenantes. J’ai mis en place un système de suivi clair (via Trello puis un fichier partagé), priorisé les retours en fonction de leur criticité, et communiqué régulièrement avec les équipes pour garantir la cohérence et la rapidité des corrections.</p><p>Cette mission m’a permis de sortir d’un rôle purement technique pour <strong>endosser une posture transversale</strong>.</p><h2>Mon niveau de compétence</h2><p>Aujourd’hui, je suis à l’aise avec les bases du management transversal, et je comprends ses enjeux dans les environnements projet. Grâce à cette expérience, j’ai appris à :</p><ul><li>Identifier les bons interlocuteurs dans une organisation complexe</li><li>Synthétiser les retours de plusieurs équipes</li><li>Arbitrer des priorités avec diplomatie</li><li>Maintenir une communication claire et régulière</li></ul><p><strong>Le management transversal est une soft skill essentielle</strong> pour faire avancer un projet dans la durée, surtout lorsqu’il s’appuie sur des outils structurants comme SAP.</p><h2>Réalisations associées</h2><ul><li>Cockpit</li><li>Project Management Tool</li><li>Portfolio</li></ul>",
    "projetsAssocies": ["Cockpit", "Project Management Tool"]
  },

  {
    "id": "gestion de projet",
    "name": "Gestion de projet",
    "category": "compétences humaines",
    "title": "Gestion de projet",
    "image": "assets/gp.jpeg",
    "description": "<h2>Introduction</h2><p>La gestion de projet est une compétence essentielle dans les environnements techniques et industriels. Elle permet de structurer les actions, coordonner les équipes et livrer des résultats fiables dans les délais impartis. Elle inclut la planification, le suivi des tâches, l’anticipation des risques et l’adaptation continue aux besoins du projet.</p><p>Dans un monde professionnel en constante évolution, la maîtrise de la gestion de projet contribue à garantir la qualité des livrables tout en optimisant l’utilisation des ressources humaines et techniques. Elle repose sur des méthodes rigoureuses mais adaptables, comme le cycle en V, l’agilité ou encore la gestion par jalons.</p><h2>Mon expérience vécue</h2><p>Durant mon alternance dans une entreprise du secteur de la parfumerie de luxe, j’ai participé activement à plusieurs projets SAP, dont le développement d’un cockpit digital de suivi de fabrication. J’ai contribué à structurer les besoins utilisateurs, à rédiger les spécifications fonctionnelles et à suivre les différentes phases du projet, de la conception à la mise en production.</p><p>J’ai également été amenée à utiliser des outils comme Jira et des méthodes inspirées de l’agilité (réunions de suivi régulières, backlog, priorisation). Mon rôle m’a permis d’agir en interface entre les équipes techniques, les utilisateurs métiers et les managers.</p><h2>Mon niveau de compétence</h2><p>Je suis aujourd’hui à l’aise avec les fondamentaux de la gestion de projet, aussi bien dans la planification que dans la coordination. Je sais identifier les étapes clés, répartir les responsabilités, suivre l’avancement et anticiper les ajustements. Je continue à me former sur les aspects avancés, notamment la gestion des risques et les indicateurs de performance (KPI).</p><h2>Réalisations associées</h2><ul><li>PMT (Project Management Tool)</li><li>Cockpit (pilotage digitalisé de la fabrication)</li></ul>",
    "projetsAssocies": ["Cockpit", "Project Management Tool"]
  },

  {
    "id": "communication",
    "name": "Communication",
    "category": "compétences humaines",
    "title": "Communication professionnelle",
    "image": "assets/communication.jpeg",
    "description": "<h2>Introduction</h2><p>La communication professionnelle est un pilier fondamental dans tout environnement de travail. Elle permet de coordonner les actions, clarifier les attentes et fluidifier les échanges au sein d’une équipe ou entre différents services. Une communication efficace renforce la collaboration, prévient les malentendus et facilite l’atteinte des objectifs communs.</p><p>Elle inclut plusieurs compétences : l’écoute active, l’adaptation du langage selon l’interlocuteur, la gestion des réunions, la reformulation d’idées complexes, et la rédaction de documents clairs et synthétiques.</p><h2>Mon expérience vécue</h2><p>Dans le cadre de mes projets en entreprise, notamment sur la mise en œuvre d’outils SAP, j’ai régulièrement animé des points d’avancement, rédigé des comptes-rendus, et relayé les besoins métier auprès des équipes techniques. J’ai souvent occupé une posture de facilitatrice pour aligner les différents acteurs autour d’une même vision.</p><p>Cette compétence s’est révélée précieuse dans les contextes de tension ou de délai serré, où il était important de maintenir un cadre d’échange structuré et positif, même en cas de désaccords techniques ou organisationnels.</p><h2>Mon niveau de compétence</h2><p>Je suis aujourd’hui capable de m’adapter à des interlocuteurs variés (développeurs, métiers, chefs de projet, direction) et de synthétiser efficacement les informations essentielles. J’utilise des outils adaptés (PowerPoint, Google Docs, Trello, mails professionnels) pour soutenir mes échanges et faciliter le suivi des projets.</p><h2>Réalisations associées</h2><ul><li>Cockpit (communication interservices entre production et IT)</li><li>Project Management Tool (suivi d’équipe, transmission des besoins fonctionnels)</li></ul>",
    "projetsAssocies": ["Cockpit", "project management tool", "gestion d'idocs"]
  },

  {
    "id": "relation client",
    "name": "Relation client",
    "category": "compétences humaines",
    "title": "Relation client",
    "image": "assets/relation-client.jpeg",
    "description": "<h2>Introduction</h2><p>La relation client repose sur la capacité à comprendre, accompagner et fidéliser les interlocuteurs externes de l’entreprise. C’est une compétence transversale qui implique empathie, clarté, réactivité et sens du service. Une bonne gestion de la relation client contribue directement à la satisfaction, à la confiance, et à la réussite des projets livrés.</p><p>Cette compétence est particulièrement cruciale dans les contextes B2B ou les environnements de projet, où les attentes du client évoluent rapidement et doivent être traduites en solutions concrètes.</p><h2>Mon expérience vécue</h2><p>J’ai été amenée à interagir régulièrement avec des utilisateurs finaux, des chefs de service ou des partenaires dans le cadre de projets SAP. Mon rôle a consisté à recueillir les besoins, à clarifier certains termes techniques, à organiser des démonstrations, ou à répondre à des demandes spécifiques de suivi.</p><p>En adoptant une posture proactive et accessible, j’ai contribué à renforcer la confiance des interlocuteurs et à maintenir des échanges constructifs, même en cas d’imprévus techniques ou de délais contraints.</p><h2>Mon niveau de compétence</h2><p>Je suis à l’aise pour gérer des échanges avec des profils variés, qu’il s’agisse de clients internes ou externes. J’accorde une grande importance à la clarté de mes messages, à l’écoute active, et à la gestion positive des retours, même critiques. Mon objectif est toujours de co-construire des solutions en lien étroit avec les attentes exprimées.</p><h2>Réalisations associées</h2><ul><li>Cockpit (accompagnement des utilisateurs métiers dans la prise en main de l’outil)</li><li>Project Management Tool (retours du Product Owner, ajustements fonctionnels)</li></ul>",
    "projetsAssocies": ["Cockpit", "Project Management Tool"]
  }







]
