[
  {
    "id": "project management tool",
    "title": "Project Management Tool",
    "description": "<h2>Présentation</h2><p>Dans le cadre de ma mission chez Code Solutions, j’ai participé au développement de <strong>Project Management Tool (PMT)</strong>, une plateforme web de gestion de projets collaboratifs. Cette application avait pour but de faciliter le travail des équipes techniques en leur fournissant un espace centralisé pour planifier, suivre et coordonner les projets. L’outil permet notamment de gérer les rôles, les tâches, et la progression de chaque projet de manière intuitive.</p><h2>Lancement du projet</h2><p>Le projet est né d’un besoin identifié par l’équipe produit : celui de centraliser le pilotage de projet dans un outil simple, personnalisable et maintenable. Le rôle de chacun était bien défini :</p><ul><li><strong>Nicolas</strong>, en tant que Product Owner, a défini les fonctionnalités sous forme de user stories.</li><li><strong>Mariana</strong>, Tech Lead, a cadré l’architecture et les standards techniques à suivre.</li></ul><p>En tant que développeuse full-stack, j’ai pris en charge l’intégralité du développement technique du projet, en m'appuyant sur les guidelines définies tout en apportant mes propres choix de structuration côté frontend et backend.</p><h2>Les étapes</h2><h3>Phase de conception</h3><p>Nous avons commencé par modéliser les entités clés de l'application (utilisateurs, projets, tâches, rôles, notifications). J’ai conçu un schéma relationnel clair pour structurer les données, puis j’ai rédigé un script SQL automatisé permettant la création rapide de l’environnement de test.</p><h3>Développement de l’interface et de l’API</h3><p>Sur la partie frontend, j’ai conçu une interface fluide et responsive avec Angular, en m’appuyant sur Angular Material pour assurer la cohérence UI. Le frontend permet la création de projets, l’attribution de rôles, et la gestion dynamique des tâches.</p><p>Côté backend, j’ai mis en place une API REST sécurisée avec Spring Boot, gérant la logique métier de l’application (CRUD projets, gestion des utilisateurs, rôles et permissions, suivi de progression).</p><h3>Phase de test</h3><p>Pour garantir la stabilité de la plateforme, j’ai mis en place une stratégie de tests complète :</p><ul><li><strong>Tests unitaires</strong> : Jest côté frontend, JUnit côté backend.</li><li><strong>Tests d’intégration</strong> : pour vérifier la cohérence entre les composants et l’API.</li></ul><p>Nous avons atteint un objectif de <strong>60% de couverture</strong>, assurant une bonne fiabilité avant le déploiement.</p><h3>Industrialisation et déploiement</h3><p>L’application a été dockerisée (frontend + backend) pour une portabilité maximale. J’ai mis en place une pipeline CI/CD avec GitHub Actions pour automatiser les tests, le build et le déploiement. Les images Docker ont été publiées sur Docker Hub, et une documentation claire a été rédigée pour permettre une prise en main rapide.</p><h2>Résultats et apprentissages</h2><p>Ce projet m’a permis de mettre en pratique des compétences essentielles pour un poste de développeur full-stack :</p><ul><li>Modélisation de base de données</li><li>Développement full-stack avec Angular &amp; Spring Boot</li><li>Mise en place de pipelines CI/CD</li><li>Rédaction de documentation claire et technique</li></ul><p>Il m’a aussi appris à travailler en collaboration étroite avec des rôles fonctionnels et techniques, à respecter des contraintes précises, et à livrer un produit industrialisé, prêt pour une mise en production.</p>",
    "year": "2025",
    "image": "assets/pmt.jpeg",
    "competencesAssociees": ["angular", "java-spring", "ux-ui"]
  },

  {
    "id": "cockpit",
    "title": "Cockpit",
    "description": "<h2>Présentation</h2><p>Dans le cadre d'une initiative de digitalisation d'un grand acteur du luxe, j’ai participé au développement du projet <strong>Cockpit</strong>, une solution de pilotage pour la fabrication de parfums. Le but était de remplacer les processus papier ou Excel par une plateforme centralisée, capable de regrouper l’ensemble des besoins de production. Le projet a été porté par Mme C.B., responsable Fabrication Parfum, et s’inscrivait dans une démarche de modernisation entamée en 2020.</p><h2>Lancement du projet</h2><p>Ce projet s’est inscrit dans la continuité des cockpits précédemment mis en place en 2020-2021 pour le suivi de la distribution des jus. En 2023, la volonté était d’étendre cette logique à la fabrication elle-même. Le besoin était clair : centraliser tous les plans de besoin en concentrés dans un seul outil, en connectant différentes sources (commandes clients, production intermédiaire, e-mails, solutions colorantes, etc.) dans un environnement unifié. Le respect du planning, la capacité à intégrer les évolutions organisationnelles, et la nécessité de formation étaient des facteurs clés du succès du projet.</p><h2>Les étapes</h2><ul><li><strong>Phase de définition des besoins</strong> : collecte et analyse des différentes sources d’information utilisées au quotidien par les équipes. Cette étape a permis de mieux comprendre les flux et de les traduire en spécifications techniques.</li><li><strong>Conception de la solution</strong> : modélisation des données et des interfaces, définition des rôles utilisateurs, rédaction des spécifications fonctionnelles. Une attention particulière a été portée à l’ergonomie pour garantir l’adoption par les opérationnels.</li><li><strong>Réalisation technique</strong> : j’ai été en charge du développement du <strong>frontend</strong>, tandis que mon collègue Nathan s’occupait du <strong>backend</strong>. Le projet s’intégrait à l’écosystème SAP, avec une interface personnalisée accessible via navigateur.</li><li><strong>Tests et formation</strong> : plusieurs itérations de tests utilisateurs ont été organisées, avec ajustements progressifs. Des sessions de formation ont été mises en place pour faciliter la prise en main de l’outil.</li></ul><h2>Résultats et retour d’expérience</h2><p>Ce projet m’a permis de travailler dans un environnement exigeant, au contact direct des utilisateurs métiers. J’ai dû faire preuve de rigueur et de communication pour assurer l’évolutivité de l’interface et la conformité avec les exigences fonctionnelles.</p><p>La collaboration étroite avec le backend et les équipes SAP m’a permis de renforcer mes compétences en intégration de systèmes et en gestion de projet technique. Cockpit est aujourd’hui utilisé au quotidien par les équipes de fabrication, offrant une vision claire et partagée des besoins de production.</p>",
    "year": "2024",
    "image": "assets/cockpit.jpeg",
    "competencesAssociees": ["sap", "abap", "ux-ui"]
  },

  {
    "id": "zfb47",
    "title": "ZFB47",
    "description": "<h2>Présentation</h2><p>Dans le cadre d'une mission au sein d'un acteur majeur du secteur du luxe, j'ai contribué au développement de la transaction <strong>ZFB47</strong>, une interface SAP Console conçue pour améliorer la gestion des contenants dans le processus de fabrication. Le projet visait à digitaliser et automatiser l'édition des étiquettes HU (Handling Unit) à la sortie d'un robot de pesée, remplaçant ainsi un processus manuel sur support papier.</p><h2>Lancement du projet</h2><p>Le besoin était de créer une interface intuitive pour les opérateurs permettant de scanner, vérifier et imprimer des étiquettes HU liées aux contenants permanents ou à usage unique. Contrairement aux flux d'autres sites, la génération des étiquettes se fait ici au moment précis de la sortie du robot de pesée. L'objectif était aussi de permettre la modification dynamique des emplacements des contenants permanents, directement depuis un terminal.</p><h2>Les étapes</h2><ul><li><strong>Développement des écrans SAP Console</strong> : mise en place d'interfaces ergonomiques, accessibles depuis des postes fixes ou mobiles, et adaptées à un environnement industriel.</li><li><strong>Impression des étiquettes HU</strong> : automatisation de l'impression via des imprimantes ZEBRA situées à la sortie du robot. Le paramétrage par défaut garantit une cohérence des données et facilite le travail des opérateurs.</li><li><strong>Changement d’emplacement des contenants</strong> : ajout d'une fonctionnalité pour modifier en temps réel l’emplacement des contenants permanents dans la base de données SAP, avec édition immédiate de l'étiquette mise à jour.</li></ul><h2>Déroulement des flux</h2><ol><li><strong>Contenants permanents</strong> : l’opérateur scanne le code-barres du contenant sur SAP Console. Le système vérifie les données, met à jour l’emplacement et lance l’impression de l’étiquette.</li><li><strong>Contenants à usage unique</strong> : l’opérateur scanne le code de l’ordre de fabrication. L’étiquette est directement générée sans modification d’emplacement.</li></ol><h2>Résultats et retour d’expérience</h2><p>La solution mise en place a permis d’accélérer et de fiabiliser l’édition des étiquettes HU, en intégrant nativement les spécificités du site de fabrication. L’ergonomie des écrans a été conçue pour s’adapter à l’usage sur terminal piéton. La traçabilité des contenants est améliorée, et le processus ne dépend plus d’étapes intermédiaires comme la création manuelle d’ordres de transfert.</p><p>Ce projet m’a permis d’approfondir mes compétences sur SAP Console, l’intégration de matériels industriels (imprimantes), et les contraintes d’interface dans des environnements critiques. Il s’agit d’une expérience concrète de mise en place d’une solution digitale au cœur d’un processus de production industriel.</p>",
    "year": "2025",
    "image": "assets/zfb47.jpeg",
    "competencesAssociees": ["ux-ui", "abap", "sap", "communication"]
  },

  {
    "id": "portfolio",
    "title": "Portfolio Développeuse Web",
    "description": "<h2>Présentation</h2><p>Ce portfolio est une application web développée dans le cadre d’un projet encadré par mon école, avec pour objectif de valoriser mes compétences techniques, humaines et mes réalisations professionnelles. Il s’agit d’un site entièrement conçu en Angular, intégrant une navigation fluide, une organisation modulaire des contenus et une interface responsive, adaptée à tout type de support.</p><h2>Lancement du projet</h2><p>Ce projet m’a été confié dans le cadre de ma formation. L’enjeu était double : maîtriser les concepts avancés du framework Angular tout en produisant une application complète et soignée, représentative de mon parcours. J’ai donc conçu le projet en autonomie, depuis l’architecture initiale jusqu’à la mise en ligne.</p><h2>Les étapes</h2><ul><li><strong>Structuration du projet Angular :</strong> utilisation des composants standalone, services injectables, routage dynamique et lazy loading.</li><li><strong>Design UI :</strong> intégration d’Angular Material, organisation en SCSS modulaires, responsive design, icônes thématiques.</li><li><strong>Contenus dynamiques :</strong> chargement des données via fichiers JSON externes (compétences, projets), usage d’<code>HttpClient</code>, affichage conditionnel.</li><li><strong>CI/CD :</strong> mise en place d’un pipeline GitHub Actions pour automatiser les builds et déploiements.</li></ul><h2>Résultats</h2><p>Le projet a été finalisé et mis en production via GitHub Pages. Il me permet de démontrer concrètement mes compétences en Angular, mais aussi de mettre en avant mes autres projets et expériences. Il sert aujourd’hui de support à mes candidatures et à mes échanges professionnels.</p><h2>Compétences associées</h2><ul><li>Angular</li><li>Gestion de projet</li><li>Communication</li></ul>",
    "year": "2025",
    "image": "assets/portfolio.jpeg",
   "competencesAssociees": ["angular", "ux-ui"]
  },

  {
    "id": "gestion d'idocs",
    "title": "Gestion des erreurs IDocs SAP",
    "image": "assets/idocs.jpeg",
    "description": "<h2>Présentation</h2><p>Ce projet s’inscrit dans un contexte de maintenance et d’amélioration continue des flux d’échanges entre systèmes SAP, à travers le traitement quotidien des erreurs IDocs (Intermediate Documents). Ces erreurs, générées lors des interfaces EDI entre partenaires ou systèmes internes, représentaient un enjeu critique pour garantir la fiabilité des processus métier.</p><h2>Lancement du projet</h2><p>En tant que consultante fonctionnelle SAP, j’ai été chargée de reprendre le suivi opérationnel des erreurs IDocs. L’objectif était de corriger les erreurs au quotidien tout en engageant une démarche d’amélioration continue pour en réduire le volume. Un processus de traitement structuré a été mis en place, avec une communication régulière auprès du client final.</p><h2>Les étapes</h2><ul><li><strong>Analyse des erreurs :</strong> diagnostic des causes via SAP (WE02, BD87), lecture des logs et traitement manuel ou automatique des IDocs bloqués.</li><li><strong>Communication client :</strong> comptes-rendus réguliers, proposition de solutions durables, sensibilisation aux causes fréquentes d’erreurs.</li><li><strong>Améliorations continues :</strong> échanges fonctionnels avec le client pour identifier des axes d’optimisation (nettoyage de données, ajustement de règles de gestion).</li><li><strong>Relation avec les développeurs :</strong> spécification des besoins d’évolution, explication des erreurs récurrentes, suivi des correctifs techniques ABAP.</li></ul><h2>Résultats</h2><ul><li>Diminution du volume d’IDocs bloqués.</li><li>Processus de suivi fiable et documenté.</li><li>Communication fluide entre les équipes (client, développeurs, support).</li></ul><h2>Compétences mobilisées</h2><ul><li>Analyse fonctionnelle SAP</li><li>Communication client</li><li>Formalisation des besoins</li><li>Gestion des priorités</li></ul>",
    "technologies": ["SAP", "IDoc", "WE02", "BD87", "ABAP"],
    "competencesAssociees": ["communication", "relation client", "gestion de projet", "abap", "sap"]
  }

]
