[
  {
    "id": "project management tool",
    "title": "Project Management Tool",
    "description": "<h2>Présentation</h2><p>Dans le cadre de ma mission chez Code Solutions, j’ai participé au développement de <strong>Project Management Tool (PMT)</strong>, une plateforme web de gestion de projets collaboratifs. Cette application avait pour but de faciliter le travail des équipes techniques en leur fournissant un espace centralisé pour planifier, suivre et coordonner les projets. L’outil permet notamment de gérer les rôles, les tâches, et la progression de chaque projet de manière intuitive.</p><h2>Lancement du projet</h2><p>Le projet est né d’un besoin identifié par l’équipe produit : celui de centraliser le pilotage de projet dans un outil simple, personnalisable et maintenable. Les enjeux étaient multiples : garantir la traçabilité des actions, fluidifier la communication entre intervenants, sécuriser les accès par rôles, et industrialiser un processus encore très dispersé. Les risques identifiés concernaient notamment l’adhésion des utilisateurs, la dette technique en cas de surcharge, et le respect des délais dans un contexte agile exigeant.</p><p>Le rôle de chacun était bien défini :</p><ul><li><strong>Nicolas</strong>, en tant que Product Owner, a défini les fonctionnalités sous forme de user stories.</li><li><strong>Mariana</strong>, Tech Lead, a cadré l’architecture et les standards techniques à suivre.</li><li>En tant que développeuse full-stack, j’ai pris en charge l’intégralité du développement technique du projet, en m'appuyant sur les guidelines définies tout en apportant mes propres choix de structuration côté frontend et backend.</li></ul><h2>Les étapes</h2><h3>Phase de conception</h3><p>Nous avons commencé par modéliser les entités clés de l'application (utilisateurs, projets, tâches, rôles, notifications). J’ai conçu un schéma relationnel clair pour structurer les données, puis j’ai rédigé un script SQL automatisé permettant la création rapide de l’environnement de test.</p><h3>Développement de l’interface et de l’API</h3><p>Sur la partie frontend, j’ai conçu une interface fluide et responsive avec Angular, en m’appuyant sur Angular Material pour assurer la cohérence UI. Le frontend permet la création de projets, l’attribution de rôles, et la gestion dynamique des tâches.</p><p>Côté backend, j’ai mis en place une API REST sécurisée avec Spring Boot, gérant la logique métier de l’application (CRUD projets, gestion des utilisateurs, rôles et permissions, suivi de progression).</p><h3>Phase de test</h3><p>Pour garantir la stabilité de la plateforme, j’ai mis en place une stratégie de tests complète :</p><ul><li><strong>Tests unitaires</strong> : Jest côté frontend, JUnit côté backend.</li><li><strong>Tests d’intégration</strong> : pour vérifier la cohérence entre les composants et l’API.</li></ul><p>Nous avons atteint un objectif de <strong>60% de couverture</strong>, assurant une bonne fiabilité avant le déploiement.</p><h3>Industrialisation et déploiement</h3><p>L’application a été dockerisée (frontend + backend) pour une portabilité maximale. J’ai mis en place une pipeline CI/CD avec GitHub Actions pour automatiser les tests, le build et le déploiement. Les images Docker ont été publiées sur Docker Hub, et une documentation claire a été rédigée pour permettre une prise en main rapide.</p><h2>Résultats</h2><p>Le PMT est désormais utilisé de manière récurrente par les équipes projets. Il a permis de réduire le temps de coordination, d’améliorer la lisibilité des responsabilités et de fluidifier les échanges entre développeurs, product owners et chefs de projet. Il a aussi renforcé la culture agile de l’entreprise en instaurant un rythme clair d’itérations et de pilotage collaboratif.</p><h2>Les lendemains du projet</h2><p>La plateforme fonctionne de manière fluide et continue d’évoluer. Des tickets d’amélioration sont régulièrement ouverts pour intégrer de nouvelles vues (comme le suivi des jalons ou l’automatisation des notifications). L’architecture modulaire mise en place permet une montée en charge progressive, et la solution est aujourd’hui pleinement adoptée par les utilisateurs métier.</p><h2>Mon regard critique</h2><p>Ce projet a été très formateur à plusieurs niveaux : coordination technique, qualité du code, documentation, livraison continue. Avec du recul, j’aurais gagné à organiser des tests utilisateurs plus tôt dans le cycle, afin d’ajuster l’ergonomie dès les premiers sprints. Cela aurait évité certaines itérations de refonte d’interface. Néanmoins, la communication au sein de l’équipe et l’industrialisation du delivery ont constitué de vrais atouts. Ce projet reste à ce jour l’un des plus complets et valorisants que j’ai pu mener.</p>",
    "year": "2025",
    "image": "assets/pmt.jpeg",
    "competencesAssociees": ["angular", "java-spring", "ux-ui", "management transversal","Agile","gestion de projet","communication","relation client"]
  },

  {
    "id": "cockpit",
    "title": "Cockpit",
    "description": "<h2>Présentation</h2><p>Dans le cadre d'une initiative de digitalisation d'un grand acteur du luxe, j’ai participé au développement du projet <strong>Cockpit</strong>, une solution de pilotage dédiée à la fabrication de parfums. L’objectif principal était de remplacer les processus manuels (papier, fichiers Excel) par une plateforme numérique centralisée, offrant une vue d’ensemble des besoins de production. Ce projet s’inscrivait dans une démarche plus large de modernisation industrielle initiée en 2020.</p><h2>Objectifs, contexte et enjeux</h2><p>En 2023, après la mise en place de plusieurs cockpits pour la distribution des jus, la volonté était d’étendre cette logique à la fabrication. L’enjeu était stratégique : offrir un outil unifié capable de centraliser l’ensemble des plans de besoin en concentrés, en connectant des sources hétérogènes (commandes, production, emails, données SAP, etc.). Les risques identifiés concernaient la résistance au changement, la complexité des flux et la nécessité de respecter les délais très serrés de production.</p><h2>Les étapes</h2><ul><li><strong>Définition des besoins :</strong> collecte et analyse des données utilisées par les équipes terrain ; cartographie des processus existants.</li><li><strong>Conception :</strong> modélisation des données et de l’interface, rôles utilisateurs, ergonomie et spécifications fonctionnelles détaillées.</li><li><strong>Réalisation technique :</strong> j’ai pris en charge le développement frontend (Angular), tandis que mon collègue Nathan s’occupait du backend. L’outil était connecté à l’environnement SAP, dans une logique d’intégration complète.</li><li><strong>Tests et formation :</strong> nous avons mené plusieurs cycles de tests utilisateurs, avec ajustements successifs, suivis de formations ciblées pour assurer une adoption fluide.</li></ul><h2>Acteurs et interactions</h2><p>Le projet a été piloté par <strong>Madame C.B.</strong>, Responsable Fabrication Parfum. J’ai travaillé étroitement avec elle, ainsi qu’avec les équipes de production, les utilisateurs finaux, le développeur backend, et les experts SAP. Cette collaboration constante a été essentielle pour construire une solution réellement adaptée au terrain.</p><h2>Résultats</h2><ul><li>Le cockpit est désormais utilisé quotidiennement par les équipes de fabrication.</li><li>Il permet un pilotage clair, réactif et centralisé des besoins en concentrés.</li><li>Il améliore la fiabilité et la fluidité de la planification de la production.</li></ul><h2>Les lendemains du projet</h2><p>Suite au succès du déploiement, des évolutions sont déjà en discussion : ajout de filtres personnalisés, intégration de nouveaux indicateurs de performance, extension à d’autres départements. L’outil est devenu une référence pour d’autres projets similaires.</p><h2>Mon regard critique</h2><p>Ce projet a été une véritable opportunité de mettre en œuvre mes compétences en développement frontend et de me confronter à un contexte métier riche et exigeant. Il m’a appris l’importance de la co-construction avec les utilisateurs, la rigueur dans le recueil des besoins et la capacité à livrer une interface intuitive dans un écosystème complexe. Il m’a aussi confortée dans ma capacité à évoluer dans des projets techniques avec un fort impact métier.</p>",
    "year": "2024",
    "image": "assets/cockpit.jpeg",
    "competencesAssociees": ["sap", "abap", "ux-ui","management transversal","gestion de projet","communication","relation client"]
  },

  {
    "id": "zfb47",
    "title": "ZFB47",
    "description": "<h2>Présentation</h2><p>Dans le cadre d'une mission au sein d’un acteur majeur du luxe, j’ai contribué au développement de la transaction <strong>ZFB47</strong>, une interface SAP Console destinée à digitaliser et automatiser l’édition des étiquettes HU (Handling Unit) dans le processus de fabrication. Elle a permis de remplacer un système manuel par un outil SAP intégré, optimisant ainsi la traçabilité des contenants en sortie du robot de pesée.</p><h2>Objectifs, contexte, enjeux et risques</h2><p>Le besoin émergeait de la volonté de fiabiliser la génération des étiquettes HU à un moment critique du process : la sortie du robot de pesée. L’objectif était de garantir une identification immédiate et correcte des contenants (permanents ou à usage unique) dans SAP, tout en évitant les erreurs humaines liées à la saisie manuelle. Les enjeux étaient forts en termes de traçabilité, d’efficacité logistique et de conformité réglementaire. Les risques principaux incluaient une mauvaise adoption de l’outil par les opérateurs, un mauvais paramétrage des imprimantes ou encore l’interruption des flux SAP critiques.</p><h2>Les étapes – ce que j’ai fait</h2><ul><li><strong>Conception des écrans SAP Console :</strong> j’ai développé des interfaces simples et ergonomiques, utilisables sur terminaux fixes et mobiles dans l’atelier.</li><li><strong>Impression automatisée des étiquettes :</strong> j’ai intégré le déclenchement automatique de l’impression sur des imprimantes industrielles ZEBRA, avec un paramétrage par défaut pour garantir la cohérence et la rapidité.</li><li><strong>Fonctionnalité de changement d’emplacement :</strong> j’ai ajouté la possibilité pour les opérateurs de modifier l’emplacement des contenants permanents dans SAP et de rééditer une étiquette mise à jour en temps réel.</li><li><strong>Tests et documentation :</strong> réalisation de scénarios de test, rédaction de documentation à destination du support technique et des utilisateurs métier.</li></ul><h2>Déroulement des flux</h2><ul><li><strong>Contenants permanents :</strong> l’opérateur scanne le contenant, le système vérifie les informations SAP, met à jour l’emplacement, puis imprime l’étiquette.</li><li><strong>Contenants à usage unique :</strong> l’opérateur scanne le code OF (ordre de fabrication), et l’étiquette est générée automatiquement sans changement d’emplacement.</li></ul><h2>Résultats – pour moi, pour l’entreprise</h2><ul><li><strong>Pour l’entreprise :</strong> réduction du temps de traitement, amélioration de la traçabilité et fiabilité des données logistiques, meilleure conformité avec les processus qualité.</li><li><strong>Pour moi :</strong> montée en compétence sur SAP Console, prise en main de l’intégration avec du matériel industriel, meilleure compréhension des contraintes métiers en environnement de production.</li></ul><h2>Les lendemains du projet</h2><p>La transaction ZFB47 a été bien accueillie. Elle est aujourd’hui utilisée de manière récurrente en atelier. Des sessions de formation sur site et des supports d’aide ont facilité l’adoption par les opérateurs. Le service client a également rapporté une nette diminution des erreurs de traçabilité liées aux étiquettes.</p><h2>Mon regard critique</h2><p>Ce projet a représenté un bon équilibre entre développement technique et compréhension métier. En rétrospective, une plus grande implication des opérateurs dès la phase de conception aurait permis d’ajuster encore mieux l’ergonomie. Néanmoins, l’interface a démontré sa robustesse et sa pertinence, et reste un bon exemple de digitalisation ciblée à forte valeur ajoutée.</p>",
    "year": "2025",
    "image": "assets/zfb47.jpeg",
    "competencesAssociees": ["ux-ui", "abap", "sap", "communication"]
  },

  {
    "id": "portfolio",
    "title": "Portfolio Développeuse Web",
    "description": "<h2>Présentation</h2><p>Ce portfolio est une application web développée dans le cadre d’un projet encadré par mon école, avec pour objectif de valoriser mes compétences techniques, humaines et mes réalisations professionnelles. Il s’agit d’un site entièrement conçu en Angular, intégrant une navigation fluide, une organisation modulaire des contenus et une interface responsive, adaptée à tout type de support.</p><h2>Objectifs, contexte, enjeux</h2><p>Ce projet m’a été confié dans le cadre de ma formation, avec un double enjeu : d’une part, maîtriser les concepts avancés du framework Angular ; d’autre part, produire une application professionnelle reflétant fidèlement mon parcours et mes compétences. Il s’agissait également de renforcer ma visibilité dans le cadre de futures candidatures. Le principal risque identifié était de ne pas parvenir à finaliser un produit à la fois complet, cohérent, et techniquement rigoureux dans les délais impartis.</p><h2>Les étapes – ce que j’ai fait</h2><ul><li><strong>Structuration du projet Angular :</strong> usage des composants standalone, services injectables, routage dynamique, lazy loading pour optimiser les performances.</li><li><strong>Design UI :</strong> intégration d’Angular Material, organisation SCSS modulaire, mise en place d’un responsive design pour une expérience fluide sur tout support.</li><li><strong>Données dynamiques :</strong> gestion de contenu via fichiers JSON externes, consommation via HttpClient, utilisation de ngFor et affichage conditionnel.</li><li><strong>CI/CD :</strong> configuration d’une pipeline GitHub Actions pour déployer automatiquement l’application sur GitHub Pages à chaque mise à jour du code.</li></ul><h2>Acteurs et interactions</h2><p>Bien que le projet ait été réalisé en autonomie, j’ai bénéficié d’un encadrement ponctuel de mon référent pédagogique. Des tests utilisateurs ont été réalisés auprès d’amis et de collègues pour ajuster l’ergonomie et l’expérience de navigation.</p><h2>Résultats – pour moi, pour l’entreprise</h2><ul><li><strong>Pour moi :</strong> ce projet a été l’occasion d’approfondir Angular dans un cadre concret et de travailler comme sur un vrai produit à livrer.</li><li><strong>Pour l’extérieur :</strong> le site est consultable en ligne, et il m’a permis d’appuyer efficacement mes candidatures en valorisant mes expériences.</li></ul><h2>Les lendemains du projet</h2><p>Depuis sa mise en ligne, le portfolio continue d’évoluer. Je l’utilise activement dans mes échanges professionnels. Des mises à jour sont prévues pour intégrer de nouveaux projets ou ajuster certains éléments graphiques en fonction des retours reçus.</p><h2>Mon regard critique</h2><p>Ce projet m’a beaucoup appris sur la rigueur nécessaire dans la structuration d’un projet front-end. Avec du recul, j’aurais pu mieux anticiper certains aspects de performance (lazy loading plus fin, minimisation des appels JSON). Je compte aussi à l’avenir séparer le contenu des compétences et des projets dans un CMS léger, afin de rendre le site plus facilement administrable. Malgré cela, je suis fière de ce portfolio qui reflète à la fois mes compétences et ma personnalité.</p>",
    "year": "2025",
    "image": "assets/portfolio.jpeg",
   "competencesAssociees": ["angular", "ux-ui","java-spring","Agile"]
  },

  {
    "id": "gestion d'idocs",
    "title": "Gestion des erreurs IDocs SAP",
    "image": "assets/idocs.jpeg",
    "description": "<h2>Présentation</h2><p>Ce projet s’inscrit dans un contexte de maintenance et d’amélioration continue des flux d’échanges entre systèmes SAP, à travers le traitement quotidien des erreurs IDocs (Intermediate Documents). Ces erreurs, générées lors des interfaces EDI entre partenaires ou systèmes internes, représentaient un enjeu critique pour garantir la fiabilité des processus métier.</p><h2>Objectifs, contexte, enjeux</h2><p>En tant que consultante fonctionnelle SAP, j’ai été chargée de reprendre le suivi opérationnel des erreurs IDocs. L’objectif était de corriger les erreurs quotidiennement tout en structurant une démarche d’amélioration durable. L’enjeu était double : maintenir la fluidité des flux inter-systèmes et éviter les impacts potentiels sur les processus avals (facturation, livraison, comptabilité). Le risque principal était de manquer des erreurs bloquantes, avec des conséquences business importantes.</p><h2>Les étapes – ce que j’ai fait</h2><ul><li><strong>Analyse des erreurs :</strong> diagnostic des causes via SAP (WE02, BD87), lecture des logs et traitement manuel ou automatique des IDocs bloqués.</li><li><strong>Communication client :</strong> envoi de comptes-rendus réguliers, proposition de solutions durables, sensibilisation aux causes fréquentes d’erreurs.</li><li><strong>Améliorations continues :</strong> échanges fonctionnels avec le client pour identifier des axes d’optimisation (nettoyage de données, ajustement des règles de gestion).</li><li><strong>Relation avec les développeurs :</strong> spécification des besoins d’évolution, suivi des correctifs techniques en ABAP, échanges avec les équipes techniques SAP.</li></ul><h2>Résultats – pour moi, pour l’entreprise</h2><ul><li>Réduction significative du volume d’IDocs bloqués.</li><li>Processus de traitement fiable, structuré, documenté.</li><li>Amélioration de la communication et de la coordination entre support, client et développeurs.</li></ul><h2>Les lendemains du projet</h2><p>Le processus mis en place continue d’être utilisé au quotidien. Il a été repris et maintenu par d’autres consultants, et a inspiré la création d’un guide interne de traitement des erreurs IDocs. Les utilisateurs ont été progressivement formés pour gagner en autonomie.</p><h2>Mon regard critique</h2><p>Ce projet a été formateur sur plusieurs plans : rigueur dans l’analyse, pédagogie dans la communication avec le client, et travail en transversal avec les développeurs. Avec du recul, j’aurais pu automatiser certains traitements plus tôt et capitaliser davantage sur les retours d’erreurs récurrents. Néanmoins, ce projet a renforcé ma capacité à gérer un processus critique dans un environnement complexe et sensible.</p>",
    "technologies": ["SAP", "IDoc", "WE02", "BD87", "ABAP"],
    "competencesAssociees": ["communication", "relation client", "gestion de projet", "abap", "sap"]
  }

]
